#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Таблица = ПолучитьИзВременногоХранилища(Параметры.ПолучаемыйПараметр);
		
	ГрафикДиаграмма.Очистить();
	//ГрафикДиаграмма.ОбластьЗаголовка.Текст = "График отпуска сотрудников"; 
		
	Серия = ГрафикДиаграмма.УстановитьСерию("Отпуск");
	Серия.Цвет = WebЦвета.ГрифельноСерый; 
	//ГрафикДиаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
			
	Для Каждого Строка Из Таблица Цикл  
		Точка = ГрафикДиаграмма.УстановитьТочку(Строка.Сотрудник);
		ЗначениеДиаграммы = ГрафикДиаграмма.ПолучитьЗначение(Точка,Серия); 
		ЗначениеДиаграммы.Данные.Продолжительность = (НачалоДня(Строка.ДатаОкончания) - НачалоДня(Строка.ДатаНачала)) / (60 * 60 * 24);
		Интервал = ЗначениеДиаграммы.Добавить(); 
		Интервал.Текст = СтрШаблон("Отпуск работника %1", Строка.Сотрудник);
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания; 
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти