
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)		
	ПроверкаТипаДоговора();	
КонецПроцедуры

&НаСервере
Процедура ПроверкаТипаДоговора()
	
	ВидДоговора = Объект.ВидДоговора;
	
	Если ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскаяПлата") Тогда
		Элементы.ВКМ_ДатаНачалаДоговора.Видимость = Ложь;
		Элементы.ВКМ_ДатаОкончанияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_ЧасоваяСтавка.Видимость = Ложь; 
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПроверкаТипаДоговора();
КонецПроцедуры
