#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗначенияРеквизитовДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВидДоговора,ВКМ_ДатаНачалаДоговора,ВКМ_ДатаОкончанияДоговора");
	Если ЗначенияРеквизитовДоговора.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскаяПлата Тогда
		ОбщегоНазначения.СообщитьПользователю("Вид договора должен быть Абонентская плата");
		Отказ = Истина;
	КонецЕсли;
	
	Если ДатаПроведенияРабот < ЗначенияРеквизитовДоговора.ВКМ_ДатаНачалаДоговора Или ДатаПроведенияРабот > ЗначенияРеквизитовДоговора.ВКМ_ДатаОкончанияДоговора Тогда
		ОбщегоНазначения.СообщитьПользователю("Дата проведения работ не соответствует датам действия договора");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.Записать();
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.ДобавитьПриход();
	//Если Договор = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскаяПлата Тогда
	//	Движение.Договор = Договор;
	//КонецЕсли;
	

КонецПроцедуры





#КонецОбласти
