
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр ВКМ_ПланОтпусков
	Движения.ВКМ_ПланОтпусков.Записывать = Истина;

	Для Каждого ТекСтрокаСотрудники Из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ПланОтпусков.Добавить();
		Движение.Период = Дата;
		Движение.Год = Год;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.НачалоОтпуска = ТекСтрокаСотрудники.ДатаНачала;
		Движение.КонецОтпуска = ТекСтрокаСотрудники.ДатаОкончания;
		Движение.КоличествоДнейОтпуска = ТекСтрокаСотрудники.КоличествоДнейОтпуска;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
