&НаКлиенте
Процедура Заполнить(Команда)
	
	Если ЗначениеЗаполнено(Объект.СписокДоговоров) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьСозданиеДокументовРеализацияТоваровИУслуг",ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, "Список добавленных в таблицу документов будет очищен." + Символы.ПС, + "Продолжить?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет );
	Иначе
		ВыполнитьСозданиеДокументовРеализацияТоваровИУслуг(КодВозвратаДиалога.Да, Новый Структура);
	КонецЕсли;
		
	//старый код из БСП 12-2
	//ДлительнаяОперация = ЗаполнитьНаСервере();
	//ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	//ПараметрыОжидания.Интервал = 1;
	//ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	//ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении",ЭтотОбъект);
	//ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,ОповещениеОЗавершении,ПараметрыОжидания);
	//конец старого кода из БСП 12-2
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСозданиеДокументовРеализацияТоваровИУслуг(РезультатВыбора, ДопПараметры) Экспорт

	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		
		Если ЗначениеЗаполнено(Объект.Период) Тогда
			
			НачалоПериода = НачалоМесяца(Объект.Период.ДатаНачала);
			КонецПериода = КонецМесяца(Объект.Период.ДатаОкончания);
	
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
			ПараметрыОжидания.Интервал = 1;
			ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
			ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		
			ОповещениеОЗавешении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
			ОповещениеОПрогрессе = Новый ОписаниеОповещения("ОповещениеОПрогрессе", ЭтотОбъект);
			ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессе;
			
			МассивСозданныхДокументов = ЗаполнитьНаСервере(НачалоПериода, КонецПериода);
			
			ДлительныеОперацииКлиент.ОжидатьЗавершение(МассивСозданныхДокументов, ОповещениеОЗавешении, ПараметрыОжидания);
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Необходимо заполнить период для автосоздания документов!";
			Сообщение.Сообщить();
			
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗаполнитьНаСервере(НачалоПериода, КонецПериода)
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,"Обработки.ВКМ_МассовоеСозданиеАктов.ВыполнитьСозданиеДокументовРеализация", НачалоПериода, КонецПериода,);
	
	//ДлительнаяОперация = ВыполнитьСозданиеДокументовРеализация(НачалоПериода, КонецПериода); - тестирование кода для создания документа
	
	Возврат ДлительнаяОперация;

КонецФункции 

&НаСервере
Функция ВыполнитьСозданиеДокументовРеализация(НачалоПериода, КонецПериода) Экспорт
	
	ЗапросДоговоровССозданнымиРеализациями = Новый Запрос;
	
	ЗапросДоговоровССозданнымиРеализациями.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслуг.Договор
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата >= &НачалоПериода
	|	И РеализацияТоваровУслуг.Дата <= &КонецПериода
	|	И РеализацияТоваровУслуг.ПометкаУдаления = &ПометкаУдаления";
	
	ЗапросДоговоровССозданнымиРеализациями.УстановитьПараметр("НачалоПериода", НачалоПериода);
	ЗапросДоговоровССозданнымиРеализациями.УстановитьПараметр("КонецПериода", КонецПериода);
	ЗапросДоговоровССозданнымиРеализациями.УстановитьПараметр("ПометкаУдаления", ЛОЖЬ);
		
	МассивДоговоровССозданнымиРеализациями = ЗапросДоговоровССозданнымиРеализациями.Выполнить().Выгрузить().ВыгрузитьКолонку("Договор");	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Договоры,
	               |	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	               |	ДоговорыКонтрагентов.Организация КАК Организация
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	               |	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДоговора < &КонецПериода
	               |	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора > &НачалоПериода
	               |	И НЕ ДоговорыКонтрагентов.Ссылка В (&МассивДоговоровССозданнымиРеализациями)
	               |	И ДоговорыКонтрагентов.ПометкаУдаления = &ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскаяПлата);
	Запрос.УстановитьПараметр("МассивДоговоровССозданнымиРеализациями", МассивДоговоровССозданнымиРеализациями);
	Запрос.УстановитьПараметр("ПометкаУдаления", ЛОЖЬ);
		
	ТЗРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	КоличествоДокументовДляСоздания = ТзРезультатЗапроса.Количество();

	МассивСозданныхДокументов = Новый Массив;	
	
		Сч = 1;
				
		Для каждого Договор Из ТЗРезультатЗапроса Цикл
		
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Заполнить(Договор.Договоры);
			НовыйДокумент.Договор = Договор.Договоры;    	 //указать договор
			НовыйДокумент.Дата = НачалоПериода;
			НовыйДокумент.СуммаДокумента = 1;
			НовыйДокумент.Контрагент = Договор.Контрагент;   //указать контрагента из договора
			НовыйДокумент.Организация = Договор.Организация; //указать организацию из договора
			Если НовыйДокумент.ПроверитьЗаполнение() Тогда
				НовыйДокумент.Записать(РежимЗаписиДокумента.Запись,);
				СсылкаНаСозданнуюРеализацию = НовыйДокумент.Ссылка;
				ДокументОбъект = СсылкаНаСозданнуюРеализацию.ПолучитьОбъект();
				ДокументОбъект.ВыполнитьАвтозаполнение();
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись,);
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение,);
			НовыйДокументРеализация = Новый Структура;
			НовыйДокументРеализация.Вставить("Договор", Договор.Договоры);
			НовыйДокументРеализация.Вставить("РеализацияТоваровИУслуг", СсылкаНаСозданнуюРеализацию);
			МассивСозданныхДокументов.Добавить(НовыйДокументРеализация);
			Иначе 
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = СтрШаблон("Не удалось записать документ по договору %1. Произошла ошибка при заполнении обязательных данных.", Договор.Договоры);
				Сообщение.Сообщить();

			Продолжить;
				
			КонецЕсли;
			
			Сч = Сч + 1;
						
			ДлительныеОперации.СообщитьПрогресс(((Сч-1)/КоличествоДокументовДляСоздания)*100);
		
		КонецЦикла;
		
		Возврат МассивСозданныхДокументов;
	
КонецФункции


&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
	
		МассивСозданныхДокументов = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
			Если МассивСозданныхДокументов.Количество() <> 0 Тогда
			
				Объект.СписокДоговоров.Очистить();
				
				Для Каждого СозданныйДокумент Из МассивСозданныхДокументов Цикл
					НоваяСтрока = Объект.СписокДоговоров.Добавить();
					НоваяСтрока.Договор = СозданныйДокумент.Договор;
					НоваяСтрока.Реализация = СозданныйДокумент.РеализацияТоваровИУслуг;
				КонецЦикла;
				
				Сообщения = Результат.Сообщения;
				
				Если Сообщения.Количество() <> 0 Тогда
				
					Для каждого Сообщение Из Сообщения Цикл
						
						Сообщить(Сообщение);
						
					КонецЦикла;
										
				КонецЕсли;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Документы успешно созданы. Количество созданных документов: %1", МассивСозданныхДокументов.Количество());
				Сообщение.Сообщить();
												
			Иначе
				
				Объект.СписокДоговоров.Очистить();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Данные для создания новых документов отсутствуют.";
				Сообщение.Сообщить();
			
			КонецЕсли;
		
	КонецЕслИ;
				
	
КонецПроцедуры 

&НаКлиенте
Процедура ОповещениеОПрогрессе(Прогресс, ДополнительныеПараметры) Экспорт
	
	Если Прогресс.Прогресс <> Неопределено Тогда
	
		Состояние("Прогресс: ", Прогресс.Прогресс.Процент);
		
	КонецЕслИ;
	
КонецПроцедуры