
Функция ВыполнитьСозданиеДокументовРеализация(НачалоПериода, КонецПериода) Экспорт
	
	ЗапросДоговоровССозданнымиРеализациями = Новый Запрос;
	
	ЗапросДоговоровССозданнымиРеализациями.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслуг.Договор
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата >= &НачалоПериода
	|	И РеализацияТоваровУслуг.Дата <= &КонецПериода
	|	И РеализацияТоваровУслуг.ПометкаУдаления = &ПометкаУдаления";
	
	ЗапросДоговоровССозданнымиРеализациями.УстановитьПараметр("НачалоПериода", НачалоПериода);
	ЗапросДоговоровССозданнымиРеализациями.УстановитьПараметр("КонецПериода", КонецПериода);
	ЗапросДоговоровССозданнымиРеализациями.УстановитьПараметр("ПометкаУдаления", ЛОЖЬ);
		
	МассивДоговоровССозданнымиРеализациями = ЗапросДоговоровССозданнымиРеализациями.Выполнить().Выгрузить().ВыгрузитьКолонку("Договор");	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Договоры,
	               |	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	               |	ДоговорыКонтрагентов.Организация КАК Организация
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	               |	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДоговора < &КонецПериода
	               |	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора > &НачалоПериода
	               |	И НЕ ДоговорыКонтрагентов.Ссылка В (&МассивДоговоровССозданнымиРеализациями)
	               |	И ДоговорыКонтрагентов.ПометкаУдаления = &ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскаяПлата);
	Запрос.УстановитьПараметр("МассивДоговоровССозданнымиРеализациями", МассивДоговоровССозданнымиРеализациями);
	Запрос.УстановитьПараметр("ПометкаУдаления", ЛОЖЬ);
		
	ТЗРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	КоличествоДокументовДляСоздания = ТзРезультатЗапроса.Количество();

	МассивСозданныхДокументов = Новый Массив;	
	
		Сч = 1;
				
		Для каждого Договор Из ТЗРезультатЗапроса Цикл
		
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Заполнить(Договор.Договоры);
			НовыйДокумент.Договор = Договор.Договоры;    	 //указать договор
			НовыйДокумент.Дата = НачалоПериода;
			НовыйДокумент.СуммаДокумента = 1;
			НовыйДокумент.Контрагент = Договор.Контрагент;   //указать контрагента из договора
			НовыйДокумент.Организация = Договор.Организация; //указать организацию из договора
			Если НовыйДокумент.ПроверитьЗаполнение() Тогда
				НовыйДокумент.Записать(РежимЗаписиДокумента.Запись,);
				СсылкаНаСозданнуюРеализацию = НовыйДокумент.Ссылка;
				ДокументОбъект = СсылкаНаСозданнуюРеализацию.ПолучитьОбъект();
				ДокументОбъект.ВыполнитьАвтозаполнение();
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись,);
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение,);
			НовыйДокументРеализация = Новый Структура;
			НовыйДокументРеализация.Вставить("Договор", Договор.Договоры);
			НовыйДокументРеализация.Вставить("РеализацияТоваровИУслуг", СсылкаНаСозданнуюРеализацию);
			МассивСозданныхДокументов.Добавить(НовыйДокументРеализация);
			Иначе 
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = СтрШаблон("Не удалось записать документ по договору %1. Произошла ошибка при заполнении обязательных данных.", Договор.Договоры);
				Сообщение.Сообщить();

			Продолжить;
				
			КонецЕсли;
			
			Сч = Сч + 1;
						
			ДлительныеОперации.СообщитьПрогресс(((Сч-1)/КоличествоДокументовДляСоздания)*100);
		
		КонецЦикла;
		
		Возврат МассивСозданныхДокументов;
	
КонецФункции 