
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ВКМ_ВыставленныеУслуги.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Если ТекСтрокаУслуги.Номенклатура = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить() Тогда
			ДвижениеУслуги = Движения.ВКМ_ВыставленныеУслуги.Добавить();
			ДвижениеУслуги.Контрагент = Контрагент;
			ДвижениеУслуги.Период = Дата;
			ДвижениеУслуги.Услуга = ТекСтрокаУслуги.Номенклатура;  
			ДвижениеУслуги.ВыставленоЧасов = ТекСтрокаУслуги.Количество;
			ДвижениеУслуги.ВыставленнаяСумма = ТекСтрокаУслуги.Сумма;
			ДвижениеУслуги.Сотрудник = Ответственный;
			ДвижениеУслуги.Договор = Договор;
			//ДвижениеУслуги.ВидДвижения = ВидДвиженияНакопления.Расход;
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ДобавленныйКод

Процедура ВыполнитьАвтозаполнение() Экспорт

	МассивПроверкиКонстант = Новый Массив; 
		
	Если ПустаяСтрока(Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить()) Тогда
		МассивПроверкиКонстант.Добавить("Не заполнена константа ""НоменклатураАбонентскаяПлата"". "); 	
		Отказ = Истина;
	КонецЕсли;
	
	Если ПустаяСтрока(Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить()) Тогда
		МассивПроверкиКонстант.Добавить("Не заполнена константа ""НоменклатураРаботыСпециалиста"". "); 	
		Отказ = Истина;
	КонецЕсли;

	Если МассивПроверкиКонстант.Количество() <> 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрСоединить(МассивПроверкиКонстант, " "));		
		Отказ = Истина;
	КонецЕсли; 
	
	ТаблицаТовары = ЭтотОбъект.Товары;
	ТаблицаУслуги = ЭтотОбъект.Услуги;
	
	ТаблицаТовары.Очистить();
	ТаблицаУслуги.Очистить(); 
	
	//Проверка если в договоре ненулевая сумма абонентской платы
	
	ЗначениеАбонентскойПлаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"ВКМ_СуммаАбонентскойПлаты");
	ЗначениеЧасовойСтавки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"ВКМ_ЧасоваяСтавка");
	
	Если ЗначениеАбонентскойПлаты <> 0 Тогда
		НоваяСтрока = ТаблицаУслуги.Добавить();
		НоваяСтрока.Номенклатура = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
		НоваяСтрока.Количество = 1;
		НоваяСтрока.Цена = ЗначениеАбонентскойПлаты;
		НоваяСтрока.Сумма = ЗначениеАбонентскойПлаты;
	КонецЕсли;

	//Проверка если в месяц даты документа в регистре ВыполненныеКлиентуРаботы есть информация о выполненных работах по этому договору
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ВыполненныеКлиентуРаботыОбороты.Клиент КАК Клиент,
	               |	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор КАК Договор,
	               |	СУММА(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовПриход) КАК КоличествоЧасовПриход,
	               |	СУММА(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеПриход) КАК СуммаКОплатеПриход
	               |ИЗ
	               |	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоПериода, &Окончаниепериода, Месяц, Договор = &Договор) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор,
	               |	ВКМ_ВыполненныеКлиентуРаботыОбороты.Клиент";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));	
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.СуммаКОплатеПриход <> 0 Тогда
			НоваяСтрока = ТаблицаУслуги.Добавить();
			НоваяСтрока.Номенклатура = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
			НоваяСтрока.Количество = Выборка.КоличествоЧасовПриход;
			НоваяСтрока.Цена = ЗначениеЧасовойСтавки;
			НоваяСтрока.Сумма = Выборка.СуммаКОплатеПриход;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
