#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	СформироватьДвижения();

КонецПроцедуры

Процедура СформироватьДвижения()
	
	// 1. сформировать дополнительные начисления
	РассчитатьДвиженияПоПремии();
	
	// 2. сформировать удержания
	РассчитатьДвиженияПоУдержаниям();
	
	// 3. сформировать движения по Взаиморасчетам
	СформироватьДвиженияВзаиморасчеты();
	
	// 4. записать движения
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();
		
КонецПроцедуры

Процедура РассчитатьДвиженияПоПремии()

	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	
	Для Каждого Строка Из ДополнительныеНачисления Цикл
		
		Если ТипЗнч(Строка.ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = Строка.Сотрудник; 
		Движение.Результат = Строка.Размер; 
			
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	
КонецПроцедуры

Процедура РассчитатьДвиженияПоУдержаниям()
	
	Движения.ВКМ_Удержания.Записывать = Истина;
	
	Для Каждого Строка Из ДополнительныеНачисления Цикл
	
		Если ТипЗнч(Строка.ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.ВКМ_Удержания") Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ИсточникНачисления = Строка.ВидРасчета;
		Движение.Сотрудник = Строка.Сотрудник; 
		Движение.Результат = Строка.Размер * 0.13; 
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры

Процедура СформироватьДвиженияВзаиморасчеты()
	
КонецПроцедуры

#КонецОбласти