
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	СформироватьДвижения();

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
	
	// 1. сформировать дополнительные начисления
	РассчитатьДвиженияПоПремии();
	
	// 2. сформировать удержания
	РассчитатьДвиженияПоУдержаниям();
	
	// 3. сформировать движения по Взаиморасчетам
	СформироватьДвиженияВзаиморасчеты();
	
	// 4. записать движения
	//Движения.ВКМ_ДополнительныеНачисления.Записать();
	//Движения.ВКМ_Удержания.Записать();
		
КонецПроцедуры

Процедура РассчитатьДвиженияПоПремии()

	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	
	Для Каждого Строка Из ДополнительныеНачисления Цикл
		
		Если ТипЗнч(Строка.ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = Строка.Сотрудник; 
		Движение.Результат = Строка.Размер;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия; 
			
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	
КонецПроцедуры

Процедура РассчитатьДвиженияПоУдержаниям()
	
	Движения.ВКМ_Удержания.Записывать = Истина;
	
	Для Каждого Строка Из ДополнительныеНачисления Цикл
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = Строка.Сотрудник; 
		Движение.Результат = Строка.Размер * 0.13;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ИсточникНачисления = Строка.ВидРасчета;  
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры

Процедура СформироватьДвиженияВзаиморасчеты()

	ПериодРегистрации = НачалоМесяца(Дата);	
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Для Каждого Строка Из ДополнительныеНачисления Цикл
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Сотрудник = Строка.Сотрудник; 
		Движение.Сумма = Строка.Размер - (Строка.Размер * 0.13);
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
		Движение.Период = ПериодРегистрации;
		
	КонецЦикла;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();

	
КонецПроцедуры

#КонецОбласти

#КонецЕсли