#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвижения();
	
КонецПроцедуры

Процедура СформироватьДвижения()

	
	// 1. сформировать основные начисления
	РассчитатьДвиженияПоЗарплате();
	РассчитатьДвиженияПоОтпуску();
	
	// 2. сформировать удержания
	РассчитатьДвиженияПоУдержаниям();
	
	// 3. сформировать движения по Взаиморасчетам
	СформироватьДвиженияВзаиморасчеты();
	
	// 4. записать движения
	Движения.ВКМ_ОсновныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры

Процедура РассчитатьДвиженияПоЗарплате()

		
	Перем ВыборкаДетальныеЗаписи, Движение, Запрос, РезультатЗапроса; 
	ПериодРегистрации = НачалоМесяца(Дата);	
	
	// подготовка данных графика и фактического периода действия для дальнейшего запроса
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	
	Для Каждого Строка Из ОсновныеНачисления Цикл 
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.ПериодДействияНачало = Строка.ДатаНачала;
		Движение.ПериодДействияКонец = КонецДня(Строка.ДатаОкончания); 
		Движение.ПериодРегистрации = ПериодРегистрации;
	КонецЦикла;
	
	Движения.Записать();
	
	// расчет
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета КАК ВидРасчета,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК РабочихДней,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК ОтработаноДней
	|ПОМЕСТИТЬ ВТ_ДанныеГрафыика
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Регистратор) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеГрафыика.НомерСтроки КАК НомерСтроки,
	|	ВТ_ДанныеГрафыика.РабочихДней КАК РабочихДней,
	|	ВТ_ДанныеГрафыика.ОтработаноДней КАК ОтработаноДней,
	|	ВТ_ДанныеГрафыика.Сотрудник КАК Сотрудник,
	|	ВТ_ДанныеГрафыика.ВидРасчета КАК ВидРасчета,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад
	|ИЗ
	|	ВТ_ДанныеГрафыика КАК ВТ_ДанныеГрафыика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|				&ПериодРегистрации,
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						ВТ_ДанныеГрафыика.Сотрудник КАК Сотрудник
	|					ИЗ
	|						ВТ_ДанныеГрафыика КАК ВТ_ДанныеГрафыика)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВТ_ДанныеГрафыика.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник";
	
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Для Каждого Движение Из Движения.ВКМ_ОсновныеНачисления Цикл  
		Выборка.Сбросить();
		Если Не Выборка.НайтиСледующий(Движение.НомерСтроки, "НомерСтроки") Тогда
			Продолжить;
		КонецЕсли;
		Движение.Результат = ?(Выборка.РабочихДней <> 0, Выборка.Оклад / Выборка.РабочихДней * Выборка.ОтработаноДней, 0);
		Движение.ОтработаноДней = Выборка.ОтработаноДней;
		Движение.РабочихДней = Выборка.РабочихДней;
		
		Если Движение.Сторно Тогда
			Движение.Результат = -Движение.Результат;
			Движение.ОтработаноДней = -Движение.ОтработаноДней;
		КонецЕсли;	
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина); // записать только то, что добавили

	
	
	
	//получение количества отработанных и рабочих дней
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки,
	//|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК РабочихДней,
	//|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК ОтработанныхДней
	//|ИЗ
	//|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Регистратор
	//|	И ВидРасчета = &Оклад) КАК ВКМ_ОсновныеНачисленияДанныеГрафика";
	//
	//Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	//Запрос.УстановитьПараметр("Регистратор", Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//Выборка = РезультатЗапроса.Выбрать();
	//
	//Для Каждого Движение Из Движения.ВКМ_ОсновныеНачисления Цикл
	//	Выборка.Сбросить();
	//	Если Не Выборка.НайтиСледующий(Движение.НомерСтроки, "НомерСтроки") Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Движение.Результат = ?(Выборка.РабочихДней <> 0, Движение.Показатель / Выборка.РабочихДней * Выборка.ОтработанныхДней, 0);
	//	Движение.ОтработаноДней = Выборка.ОтработанныхДней;
	//	
	//	Если Движение.Сторно Тогда
	//		Движение.Результат = -Движение.Результат;
	//		Движение.ОтработаноДней = -Движение.ОтработаноДней;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//Движения.ВКМ_ОсновныеНачисления.Записать(, Истина); // записать только то, что добавили
	
КонецПроцедуры

Процедура РассчитатьДвиженияПоОтпуску()

КонецПроцедуры

Процедура РассчитатьДвиженияПоУдержаниям()
	
	Движения.ВКМ_Удержания.Записывать = Истина;
	
	
	
	Для Каждого Строка Из ОсновныеНачисления Цикл
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = Строка.Сотрудник; 
		//Движение.Результат = Строка.Размер * 0.13;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ИсточникНачисления = Строка.ВидРасчета;  
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры

Процедура СформироватьДвиженияВзаиморасчеты()

	ПериодРегистрации = НачалоМесяца(Дата);		
	
КонецПроцедуры

#КонецОбласти