
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//старый код до 25.01.2025
	СформироватьДвижения();
	
КонецПроцедуры  

#КонецОбласти


#Область СлужебныеПроцедурыИФункции



Процедура СформироватьДвижения()
	
	// Начало: на время 21.01.2025 код сделать неактивным
	
	// 1. сформировать основные начисления
	РассчитатьДвиженияПоЗарплате();
	РассчитатьДвиженияПоОтпуску();
	РассчитатьДвиженияПоУдержаниям();
	
	// 2. сформировать движения по Взаиморасчетам
	//СформироватьДвиженияВзаиморасчеты();
	
	// 3. записать движения
	//Движения.ВКМ_ОсновныеНачисления.Записать();
	//Движения.ВКМ_Удержания.Записать();
	
	// Окончание: на время 21.01.2025 код сделать неактивным 
	
КонецПроцедуры

Процедура РассчитатьДвиженияПоЗарплате()
	
	Перем ВыборкаДетальныеЗаписи, Движение, Запрос, РезультатЗапроса; 
	
	ПериодРегистрации = НачалоМесяца(Дата);	
	
	// подготовка данных графика и фактического периода действия для дальнейшего запроса
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	//	02.02.25 Перенос кода расчета удержаний в отдельную процедуру для расчета НДФЛ с помощью базы
	//Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Для Каждого Строка Из ОсновныеНачисления Цикл 
		//осн начисления
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.ПериодДействияНачало = Строка.ДатаНачала;
		Движение.ПериодДействияКонец = КонецДня(Строка.ДатаОкончания); 
		Движение.ПериодРегистрации = ПериодРегистрации; 
		
		Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			Движение.БазовыйПериодНачало = ДобавитьМесяц(ПериодРегистрации, - 12);
			Движение.БазовыйПериодКонец = ПериодРегистрации - 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.Записать();
	
	// расчет
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета КАК ВидРасчета,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК РабочихДней,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК ОтработаноДней
	|ПОМЕСТИТЬ ВТ_ДанныеГрафыика
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Регистратор) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеГрафыика.НомерСтроки КАК НомерСтроки,
	|	ВТ_ДанныеГрафыика.РабочихДней КАК РабочихДней,
	|	ВТ_ДанныеГрафыика.ОтработаноДней КАК ОтработаноДней,
	|	ВТ_ДанныеГрафыика.Сотрудник КАК Сотрудник,
	|	ВТ_ДанныеГрафыика.ВидРасчета КАК ВидРасчета,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад,
	|	ЕСТЬNULL(ВложенныйЗапрос.ПроцентОтРабот, 0) КАК ПроцентОтРабот,
	|	ЕСТЬNULL(ВложенныйЗапрос.СуммаКОплатеОборот, 0) КАК СуммаКОплатеОборот,
	|	ЕСТЬNULL(ВложенныйЗапрос.СуммаКОплатеПриход, 0) КАК СуммаКОплатеПриход,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.КатегорияСотрудника КАК КатегорияСотрудника
	|ИЗ
	|	ВТ_ДанныеГрафыика КАК ВТ_ДанныеГрафыика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|				&ПериодРегистрации,
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						ВТ_ДанныеГрафыика.Сотрудник КАК Сотрудник
	|					ИЗ
	|						ВТ_ДанныеГрафыика КАК ВТ_ДанныеГрафыика)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВТ_ДанныеГрафыика.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник,
	|	(ВЫБРАТЬ
	|		ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник КАК Сотрудник,
	|		ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот КАК СуммаКОплатеОборот,
	|		ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход КАК СуммаКОплатеПриход,
	|		ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеРасход КАК СуммаКОплатеРасход,
	|		ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
	|	ИЗ
	|		РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(
	|				&НачалоПериода,
	|				&ОкончаниеПериода,
	|				,
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						ВТ_ДанныеГрафыика.Сотрудник КАК Сотрудник
	|					ИЗ
	|						ВТ_ДанныеГрафыика КАК ВТ_ДанныеГрафыика)) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, КатегорияСотрудника = ЗНАЧЕНИЕ(Перечисление.ВКМ_КатегорияСотрудника.Специалисты)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|			ПО ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("НачалоПериода",ПериодРегистрации);
	Запрос.УстановитьПараметр("ОкончаниеПериода",КонецМесяца(Дата));
	Запрос.УстановитьПараметр("КатегорияСотрудника",Перечисления.ВКМ_КатегорияСотрудника.Специалисты); 
	Запрос.УстановитьПараметр("Период",ПериодРегистрации);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	
	//осн начисления
	Для Каждого Движение Из Движения.ВКМ_ОсновныеНачисления Цикл  
		
		Если Движение.ВидРасчета <> ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			Продолжить;
		КонецЕсли; 
		
		Выборка.Сбросить();
		
		Выборка.НайтиСледующий(Движение.НомерСтроки, "НомерСтроки");
					
		Движение.Результат = ?(Выборка.РабочихДней <> 0, Выборка.Оклад / Выборка.РабочихДней * Выборка.ОтработаноДней, 0);
		Движение.ОтработаноДней = Выборка.ОтработаноДней;
		Движение.РабочихДней = Выборка.РабочихДней;
		
		//начислить премию за работы
		Если Выборка.КатегорияСотрудника = Перечисления.ВКМ_КатегорияСотрудника.Специалисты Тогда
			ДвижениеПремия = Движения.ВКМ_ДополнительныеНачисления.Добавить();
			ДвижениеПремия.Сотрудник = Выборка.Сотрудник;
			ДвижениеПремия.ПериодРегистрации = ПериодРегистрации;
			ДвижениеПремия.Результат = Выборка.СуммаКОплатеОборот;
			ДвижениеПремия.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентЗаРаботы;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
				
		//взаиморасчеты
		ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		ДвижениеВзаиморасчеты.Сотрудник = Выборка.Сотрудник;
		ДвижениеВзаиморасчеты.ВидРасчета = Выборка.ВидРасчета;
		ДвижениеВзаиморасчеты.Период = ПериодРегистрации;
		ДвижениеВзаиморасчеты.Сумма = Движение.Результат;
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(); 
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать(); 
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	
КонецПроцедуры

Процедура РассчитатьДвиженияПоОтпуску()
	
	ПериодРегистрации = НачалоМесяца(Дата);	
	
	// расчет базы	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета КАК ВидРасчета,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК РабочихДней,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК ОтработаноДней,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ПериодДействия КАК ПериодДействия,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ПериодДействияКонец КАК ПериодДействияКонец,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ПериодДействияНачало КАК ПериодДействияНачало
	|ПОМЕСТИТЬ ВТ_ДанныеГрафика
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Регистратор) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ВТ_ДанныеГрафика.Сотрудник КАК Сотрудник,
	|	ВТ_ДанныеГрафика.ВидРасчета КАК ВидРасчета,
	|	ВТ_ДанныеГрафика.РабочихДней КАК РабочихДней,
	|	ВТ_ДанныеГрафика.ОтработаноДней КАК ОтработаноДней,
	|	РАЗНОСТЬДАТ(ВТ_ДанныеГрафика.ПериодДействияНачало, ВТ_ДанныеГрафика.ПериодДействияКонец, ДЕНЬ) КАК КалендарныхДней,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) КАК НачисленоЗаБазовыйПериод,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ОтработаноДнейБаза, 0) КАК ОтработанныхДнейЗаБазовыйПериод
	|ИЗ
	|	ВТ_ДанныеГрафика КАК ВТ_ДанныеГрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|				&ПериодРегистрации,
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						ВТ_ДанныеГрафика.Сотрудник КАК Сотрудник
	|					ИЗ
	|						ВТ_ДанныеГрафика КАК ВТ_ДанныеГрафика)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВТ_ДанныеГрафика.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(
	|				&Измерения,
	|				&Измерения,
	|				,
	|				Регистратор = &Регистратор
	|					И ВидРасчета = &ВидРасчета) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
	|		ПО ВТ_ДанныеГрафика.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки";
	
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Выборка = РезультатЗапроса.Выбрать();
	//ТЗ = РезультатЗапроса.Выгрузить();
	
	Для Каждого Движение Из Движения.ВКМ_ОсновныеНачисления Цикл
		
		Если Движение.ВидРасчета <> ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			Продолжить;
		КонецЕсли;
			
		Выборка.Сбросить();
		Выборка.НайтиСледующий(Движение.НомерСтроки, "НомерСтроки");
		
		Движение.ОтработаноДней = Выборка.ОтработанныхДнейЗаБазовыйПериод;
		Движение.БазаЗа12Месяцев = Выборка.НачисленоЗаБазовыйПериод; 
		
		СредняяДневнаяСтавка = ?(Выборка.ОтработанныхДнейЗаБазовыйПериод <> 0,Выборка.НачисленоЗаБазовыйПериод / Выборка.ОтработанныхДнейЗаБазовыйПериод, 0);
		
		Движение.Результат = СредняяДневнаяСтавка * Выборка.КалендарныхДней;
		
		//движение взаиморасчеты в +
		ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		ДвижениеВзаиморасчеты.Сотрудник = Выборка.Сотрудник;
		ДвижениеВзаиморасчеты.ВидРасчета = Выборка.ВидРасчета;
		ДвижениеВзаиморасчеты.Период = ПериодРегистрации;
		ДвижениеВзаиморасчеты.Сумма = Движение.Результат;
		
	КонецЦикла;	
	
	Движения.ВКМ_ОсновныеНачисления.Записать(); 
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
		
КонецПроцедуры

Процедура РассчитатьДвиженияПоУдержаниям(); 

	ПериодРегистрации = НачалоМесяца(Дата);
	
	Движения.ВКМ_Удержания.Записывать = Истина;
		
	Для Каждого Строка Из ОсновныеНачисления Цикл 
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.БазовыйПериодНачало = НачалоМесяца(Строка.ДатаНачала);
		Движение.БазовыйПериодКонец = НачалоДня(КонецМесяца(Строка.ДатаОкончания));
		Движение.ПериодДействияНачало = НачалоМесяца(Строка.ДатаНачала);
		Движение.ПериодДействияКонец = НачалоДня(КонецМесяца(Строка.ДатаОкончания));
		Движение.ПериодРегистрации = Дата;
    КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_Удержания.Сотрудник КАК Сотрудник,
	               |	ВКМ_Удержания.НомерСтроки КАК НомерСтроки,
	               |	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.БазовыйПериодНачало КАК БазовыйПериодНачало,
	               |	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.БазовыйПериодКонец КАК БазовыйПериодКонец,
	               |	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РегистраторРазрез КАК РегистраторРазрез,
	               |	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза КАК РезультатБаза
	               |ИЗ
	               |	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(
	               |				&Измерения,
	               |				&Измерения,
	               |				&Разрезы,
	               |				ВидРасчета = &НДФЛ
	               |					И Регистратор = &Ссылка) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления
	               |		ПО ВКМ_Удержания.НомерСтроки = ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки
	               |			И ВКМ_Удержания.Сотрудник = ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Сотрудник
	               |ГДЕ
	               |	ВКМ_Удержания.Регистратор = &Ссылка
	               |	И ВКМ_Удержания.ВидРасчета = &НДФЛ
	               |	И ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РегистраторРазрез = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВКМ_Удержания.Сотрудник,
	               |	ВКМ_Удержания.НомерСтроки,
	               |	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.БазовыйПериодНачало,
	               |	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.БазовыйПериодКонец,
	               |	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РегистраторРазрез,
	               |	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза";
	   
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	Запрос.УстановитьПараметр("Сотрудник", Движение.Сотрудник); 
	Запрос.УстановитьПараметр("НДФЛ", ПланыВидовРасчета.ВКМ_Удержания.НДФЛ);
	
	Разрезы = Новый Массив;
	Разрезы.Добавить("Регистратор");
	Запрос.УстановитьПараметр("Разрезы", Разрезы);
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	РезультатЗапросаТЗ = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса = Запрос.Выполнить();
		
	Выборка = РезультатЗапроса.Выбрать();
	
	Для Каждого Движение Из Движения.ВКМ_Удержания Цикл
		Выборка.Сбросить();
		Выборка.НайтиСледующий(Движение.НомерСтроки, "НомерСтроки");
		
		Движение.НалоговаяБаза = Выборка.РезультатБаза;
		Движение.Результат = Выборка.РезультатБаза * 0.13;
		
		//движение Взаиморасчеты с сотрудниками в -
		ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьРасход();
		ДвижениеВзаиморасчеты.Сотрудник = Выборка.Сотрудник;
		ДвижениеВзаиморасчеты.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		ДвижениеВзаиморасчеты.Период = ПериодРегистрации;
		ДвижениеВзаиморасчеты.Сумма = Движение.Результат;
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли