#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвижения();
	
КонецПроцедуры

Процедура СформироватьДвижения()

	
	// 1. сформировать дополнительные начисления
	РассчитатьДвиженияПоЗарплате();
	
	// 2. сформировать удержания
	РассчитатьДвиженияПоУдержаниям();
	
	// 3. сформировать движения по Взаиморасчетам
	СформироватьДвиженияВзаиморасчеты();
	
	// 4. записать движения
	Движения.ВКМ_ОсновныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры

Процедура РассчитатьДвиженияПоЗарплате()

	// 1 этап. расчет зарплаты
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК РабочихДней,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК ОтработанныхДней
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Регистратор
	|	И ВидРасчета = &Оклад) КАК ВКМ_ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Для Каждого Движение Из Движения.ВКМ_ОсновныеНачисления Цикл
		Выборка.Сбросить();
		Если Не Выборка.НайтиСледующий(Движение.НомерСтроки, "НомерСтроки") Тогда
			Продолжить;
		КонецЕсли;
		
		Движение.Результат = ?(Выборка.РабочихДней <> 0, Движение.Показатель / Выборка.РабочихДней * Выборка.ОтработанныхДней, 0);
		Движение.ОтработаноДней = Выборка.ОтработанныхДней;
		
		Если Движение.Сторно Тогда
			Движение.Результат = -Движение.Результат;
			Движение.ОтработаноДней = -Движение.ОтработаноДней;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина); // записать только то, что добавили
	
КонецПроцедуры

Процедура РассчитатьДвиженияПоУдержаниям()
	
	Движения.ВКМ_Удержания.Записывать = Истина;
	
	Для Каждого Строка Из ОсновныеНачисления Цикл
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = Строка.Сотрудник; 
		//Движение.Результат = Строка.Размер * 0.13;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ИсточникНачисления = Строка.ВидРасчета;  
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры

Процедура СформироватьДвиженияВзаиморасчеты()

	ПериодРегистрации = НачалоМесяца(Дата);		
	
КонецПроцедуры

#КонецОбласти