#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	РассчитатьКоличествоДнейОтпуска();
КонецПроцедуры
	
&НаКлиенте
Процедура РассчитатьКоличествоДнейОтпуска()
		
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
			
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала) Или Не ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания) Тогда
		Возврат;
	Иначе
		ТекущиеДанные.КоличествоДнейОтпуска = 1 + (НачалоДня(ТекущиеДанные.ДатаОкончания) - НачалоДня(ТекущиеДанные.ДатаНачала))/(60*60*24);	
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьДиаграммуГанта(Команда)

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПолучаемыйПараметр",ПолучитьАдрес());
		
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика",СтруктураПараметров);
	
КонецПроцедуры

Функция ПолучитьАдрес()
	
	//Таблица = Новый ТаблицаЗначений;
	//Таблица = РеквизитФормыВЗначение("Объект.ОтпускаСотрудников");
	
	ТЗ = Объект.ОтпускаСотрудников.Выгрузить();	
	
	Адрес = ПоместитьВоВременноеХранилище(ТЗ, ЭтаФорма.УникальныйИдентификатор);
	Возврат Адрес;	
	
КонецФункции  

#КонецОбласти

