#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	РассчитатьКоличествоДнейОтпуска();
КонецПроцедуры
	
&НаКлиенте
Процедура РассчитатьКоличествоДнейОтпуска()
		
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
			
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала) Или Не ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания) Тогда
		Возврат;
	Иначе
		ТекущиеДанные.КоличествоДнейОтпуска = 1 + (НачалоДня(ТекущиеДанные.ДатаОкончания) - НачалоДня(ТекущиеДанные.ДатаНачала))/(60*60*24);	
	КонецЕсли;
		
	//Для Каждого Строка Из Элементы.ОтпускаСотрудников Цикл
	
		//Если Строка.
		
		//КонецЕсли;
	
	//КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

