
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр ВКМ_ВзаиморасчетыССотрудниками Расход
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудники Из Выплаты Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.ВидРасчета = ТекСтрокаСотрудники.ВидРасчета;
		Движение.Сумма = ТекСтрокаСотрудники.Сумма;
	КонецЦикла;
	
КонецПроцедуры

